var labelLoc = {
		41:{
			"y":40,
			"isgroup":0,
		},      //서울, 경기도
		44:{
			"y":5,
			"isgroup":0,
		},      //세종, 충남
		41281:{
			"x":-50,
			"y":-30,
			"isgroup":1,
		},		//고양시덕양구
		41285:{
			"x":-30,
			"y":-20,
			"isgroup":1,
		},		//고양시일산동구
		41287:{
			"x":-10,
			"y":-20,
			"isgroup":1,
		},		//고양시일산서구
		41131:{
			"x":-20,
			"y":-20,
			"isgroup":1,
		},		//성남시 수정구
		41133:{
			"x":-40,
			"y":-20,
			"isgroup":1,
		},		//성남시 중원구
		41135:{
			"x":-20,
			"y":-45,
			"isgroup":1,
		},		//성남시 분당구
		41171:{
			"x":-20,
			"y":-30,
			"isgroup":1,
		},		//안양시만안구
		41173:{
			"x":-20,
			"y":-30,
			"isgroup":1,
		},		//안양시동안구
		41465:{
			"x":10,
			"y":10,
			"isgroup":1,
		},		//용인시수지구
		41461:{
			"x":-55,
			"y":-50,
			"isgroup":1,
		},		//용인시처인구
		41463:{
			"x":-10,
			"y":-20,
			"isgroup":1,
		},		//용인시기흥구
		41271:{
			"x":-40,
			"y":-35,
			"isgroup":1,
		},		//안산시상록구
		41273:{
			"x":25,
			"y":-50,
			"isgroup":1,
		},		//안산시단원구
		41111:{
			"x":-20,
			"y":-20,
			"isgroup":1,
		},		//수원시 장안구
		41113:{
			"x":-50,
			"y":-25,
			"isgroup":1,
		},		//수원시 권선구
		41115:{
			"x":-25,
			"y":-35,
			"isgroup":1,
		},		//수원시 팔달구
		41117:{
			"x":-40,
			"y":-35,
			"isgroup":1,
		},		//수원시 영통구
		41171:{
			"x":-10,
			"y":-30,
			"isgroup":1,
		},		//안양시 만안구
		41173:{
			"x":-25,
			"y":-30,
			"isgroup":1,
		},		//안양시 동안구
		41195:{
			"isgroup":1,
		},		//부천시 원미구
		41197:{
			"x":-30,
			"y":-40,
			"isgroup":1,
		},		//부천시 소사구
		41199:{
			"x":-30,
			"y":-15,
			"isgroup":1,
		},		//부천시 오정구
		47111:{
			"x":-30,
			"y":-40,
			"isgroup":1,
		},		//포항시 남구
		47113:{
			"x":10,
			"y":10,
			"isgroup":1,
		},		//포항시 북구
		26140:{
			"isgroup":0,
			"y":-40,
		},		//부산시 서구
		48121:{
			"x":-30,
			"y":-40,
			"isgroup":1,
		},		//창원시 의창구
		48123:{
			"x":-55,
			"isgroup":1,
		},		//창원시 성산구
		48125:{
			"x":10,
			"y":-60,
			"isgroup":1,
		},		//창원시 마산합포구
		48127:{
			"x":-5,
			"y":-15,
			"isgroup":1,
		},		//창원시 마산회원구
		48129:{
			"x":-80,
			"y":-60,
			"isgroup":1,
		},		//창원시 진해구
		43111:{
			"x":-60,
			"y":-55,
			"isgroup":1,
		},		//청주시 상당구
		43112:{
			"x":-5,
			"y":-75,
			"isgroup":1,
		},		//청주시 서원구
		43113:{
			"x":20,
			"y":-30,
			"isgroup":1,
		},		//청주시 흥덕구
		43114:{
			"x":-25,
			"y":5,
			"isgroup":1,
		},		//청주시 청원구
		44131:{
			"x":-25,
			"y":-70,
			"isgroup":1,
		},		//천안시 동남구
		44133:{
			"x":-5,
			"y":-10,
			"isgroup":1,
		},		//천안시 서북구
		45111:{
			"x":-25,
			"y":-50,
			"isgroup":1,
		},		//전주시 완산구
		45113:{
			"x":-20,
			"y":-20,
			"isgroup":1,
		},		//전주시 덕진구
		41570256:{
			"x":-90,
			"y":-180,
			"isgroup":0,
		},		//김해시 양촌읍
		41570108:{
			"x":-110,
			"y":-140,
			"isgroup":0,
		},		//김해시 마산동
		41570109:{
			"x":-120,
			"y":-150,
			"isgroup":0,
		},		//김해시 구래동
		41650105:{
			"x":-80,
			"y":-85,
			"isgroup":0,
		},		//포천시 설운동
		41650106:{
			"x":-80,
			"y":-80,
			"isgroup":0,
		},		//포천시 동교동
		41550130:{
			"x":-240,
			"y":-290,
			"isgroup":0,
		},		//안성시 신모산동
		11290104:{
			"x":-410,
			"y":-597,
			"isgroup":1,
		},		//서울시 성북구 동소문동
		11290105:{
			"x":-420,
			"y":-606,
			"isgroup":1,
		},		//서울시 성북구 동소문동
		11290106:{
			"x":-440,
			"y":-592,
			"isgroup":1,
		},		//서울시 성북구 동소문동
		11290107:{
			"x":-435,
			"y":-581,
			"isgroup":1,
		},		//서울시 성북구 동소문동
		11290108:{
			"x":-468,
			"y":-582,
			"isgroup":1,
		},		//서울시 성북구 동소문동
		11290109:{
			"x":-460,
			"y":-565,
			"isgroup":1,
		},		//서울시 성북구 동소문동
		11290110:{
			"x":-460,
			"y":-540,
			"isgroup":1,
		},		//서울시 성북구 동소문동
		11290111:{
			"x":-430,
			"y":-570,
			"isgroup":1,
		},		//서울시 성북구 삼선동
		11290112:{
			"x":-455,
			"y":-581,
			"isgroup":1,
		},		//서울시 성북구 삼선동
		11290113:{
			"x":-466,
			"y":-558,
			"isgroup":1,
		},		//서울시 성북구 삼선동
		11290114:{
			"x":-465,
			"y":-529,
			"isgroup":1,
		},		//서울시 성북구 삼선동
		11290115:{
			"x":-485,
			"y":-540,
			"isgroup":1,
		},		//서울시 성북구 삼선동
		11290116:{
			"x":-445,
			"y":-563,
			"isgroup":1,
		},		//서울시 성북구 동선동
		11290117:{
			"x":-455,
			"y":-581,
			"isgroup":1,
		},		//서울시 성북구 동선동
		11290118:{
			"x":-466,
			"y":-549,
			"isgroup":1,
		},		//서울시 성북구 동선동
		11290119:{
			"x":-449,
			"y":-538,
			"isgroup":1,
		},		//서울시 성북구 동선동
		11290120:{
			"x":-440,
			"y":-531,
			"isgroup":1,
		},		//서울시 성북구 동선동
		11290121:{
			"x":-420,
			"y":-558,
			"isgroup":1,
		},		//서울시 성북구 안암동
		11290122:{
			"x":-429,
			"y":-574,
			"isgroup":1,
		},		//서울시 성북구 안암동
		11290123:{
			"x":-429,
			"y":-602,
			"isgroup":1,
		},		//서울시 성북구 안암동
		11290124:{
			"x":-439,
			"y":-625,
			"isgroup":1,
		},		//서울시 성북구 안암동
		11290125:{
			"x":-465,
			"y":-558,
			"isgroup":1,
		},		//서울시 성북구 안암동
		11290126:{
			"x":-475,
			"y":-578,
			"isgroup":1,
		},		//서울시 성북구 보문동
		11290127:{
			"x":-465,
			"y":-584,
			"isgroup":1,
		},		//서울시 성북구 보문동
		11290128:{
			"x":-457,
			"y":-600,
			"isgroup":1,
		},		//서울시 성북구 보문동
		11290129:{
			"x":-482,
			"y":-605,
			"isgroup":1,
		},		//서울시 성북구 보문동
		11290130:{
			"x":-462,
			"y":-550,
			"isgroup":1,
		},		//서울시 성북구 보문동
		11290131:{
			"x":-452,
			"y":-555,
			"isgroup":1,
		},		//서울시 성북구 보문동
		11290132:{
			"x":-440,
			"y":-570,
			"isgroup":1,
		},		//서울시 성북구 보문동
		11200109:{
			"x":-440,
			"y":-580,
			"isgroup":0,
		},		//서울시 성동구 금호동1가
		11200102:{
			"x":-440,
			"y":-560,
			"isgroup":0,
		},		//서울시 성동구 하왕십리동
		11140106:{
			"x":-1110,
			"y":-1420,
			"isgroup":0,
		},		//서울시 중구 남대문로1가
		11140115:{
			"x":-1110,
			"y":-1420,
			"isgroup":0,
		},		//서울시 중구 남대문로2가
		11140140:{
			"x":-1110,
			"y":-1420,
			"isgroup":0,
		},		//서울시 중구 남학동
		11110148:{
			"x":-450,
			"y":-550,
			"isgroup":0,
		},		//서울시 종로구 계동
		11110123:{
			"x":-1100,
			"y":-1430,
			"isgroup":0,
		},		//서울시 종로구 서린동
		11110135:{
			"x":-1125,
			"y":-1430,
			"isgroup":0,
		},		//서울시 종로구 관철동
		11110155:{
			"x":-1100,
			"y":-1430,
			"isgroup":0,
		},		//서울시 종로구 관수동
		11560125:{
			"x":-425,
			"y":-620,
			"isgroup":1,
		},		//서울시 영등포구 양평동1가
		11560126:{
			"x":-390,
			"y":-620,
			"isgroup":1,
		},		//서울시 영등포구 양평동2가
		11560127:{
			"x":-440,
			"y":-570,
			"isgroup":1,
		},		//서울시 영등포구 양평동3가
		11560128:{
			"x":-475,
			"y":-507,
			"isgroup":1,
		},		//서울시 영등포구 양평동4가
		11560129:{
			"x":-450,
			"y":-480,
			"isgroup":1,
		},		//서울시 영등포구 양평동5가
		11560130:{
			"x":-430,
			"y":-450,
			"isgroup":1,
		},		//서울시 영등포구 양평동6가
		11560111:{
			"x":-450,
			"y":-607,
			"isgroup":1,
		},		//서울시 영등포구 당산동1가
		11560112:{
			"x":-416,
			"y":-600,
			"isgroup":1,
		},		//서울시 영등포구 당산동2가
		11560113:{
			"x":-440,
			"y":-570,
			"isgroup":1,
		},		//서울시 영등포구 당산동3가
		11560114:{
			"x":-454,
			"y":-543,
			"isgroup":1,
		},		//서울시 영등포구 당산동4가
		11560115:{
			"x":-468,
			"y":-516,
			"isgroup":1,
		},		//서울시 영등포구 당산동5가
		11560116:{
			"x":-479,
			"y":-493,
			"isgroup":1,
		},		//서울시 영등포구 당산동6가
		11560119:{
			"x":-469,
			"y":-601,
			"isgroup":1,
		},		//서울시 영등포구 문래동1가
		11560120:{
			"x":-442,
			"y":-595,
			"isgroup":1,
		},		//서울시 영등포구 문래동2가
		11560121:{
			"x":-461,
			"y":-556,
			"isgroup":1,
		},		//서울시 영등포구 문래동3가
		11560122:{
			"x":-420,
			"y":-580,
			"isgroup":1,
		},		//서울시 영등포구 문래동4가
		11560123:{
			"x":-379,
			"y":-560,
			"isgroup":1,
		},		//서울시 영등포구 문래동5가
		11560124:{
			"x":-383,
			"y":-534,
			"isgroup":1,
		},		//서울시 영등포구 문래동6가
		11560102:{
			"x":-484,
			"y":-621,
			"isgroup":1,
		},		//서울시 영등포구 영등포동1가
		11560103:{
			"x":-480,
			"y":-595,
			"isgroup":1,
		},		//서울시 영등포구 영등포동2가
		11560104:{
			"x":-449,
			"y":-615,
			"isgroup":1,
		},		//서울시 영등포구 영등포동3가
		11560105:{
			"x":-420,
			"y":-619,
			"isgroup":1,
		},		//서울시 영등포구 영등포동4가
		11560106:{
			"x":-441,
			"y":-592,
			"isgroup":1,
		},		//서울시 영등포구 영등포동5가
		11560107:{
			"x":-416,
			"y":-587,
			"isgroup":1,
		},		//서울시 영등포구 영등포동6가
		11560108:{
			"x":-443,
			"y":-562,
			"isgroup":1,
		},		//서울시 영등포구 영등포동7가
		11560109:{
			"x":-431,
			"y":-527,
			"isgroup":1,
		},		//서울시 영등포구 영등포동8가
		11440117:{
			"x":-450,
			"y":-560,
			"isgroup":0,
		},		//서울시 마포구 신정동
		41281125:{
			"x":-130,
			"y":-150,
			"isgroup":0,
		},		//고양시 행주내동
		41281122:{
			"x":-130,
			"y":-160,
			"isgroup":0,
		},		//고양시 대장동
		41131104:{
			"x":-230,
			"y":-270,
			"isgroup":0,
		},		//수원시 단대동
		41115126:{
			"x":-655,
			"y":-845,
			"isgroup":0,
		},		//수원시 구천동
		41115124:{
			"x":-655,
			"y":-845,
			"isgroup":0,
		},		//수원시 매향동
	};

var legendLoc = {
		42:{
			"x":10,
			"y":520,
		},
		44:{
			"x":10,
			"y":520,
		},
		28:{
			"x":10,
			"y":520,
		},
		48:{
			"x":10,
			"y":520,
		},
		41:{
			"x":670,
			"y":10,
		},
		41570:{
			"x":670,
			"y":10,
		},
		41800:{
			"x":10,
			"y":10,
		},
		41670:{
			"x":10,
			"y":520,
		},
		41610:{
			"x":10,
			"y":520,
		},
		41500:{
			"x":10,
			"y":520,
		},
		41220:{
			"x":10,
			"y":520,
		},
		41480:{
			"x":10,
			"y":520,
		},
		11710:{
			"x":10,
			"y":520,
		},
		11680:{
			"x":10,
			"y":520,
		},
		11650:{
			"x":670,
			"y":10,
		},
		11110:{
			"x":670,
			"y":10,
		},
		11500:{
			"x":670,
			"y":10,
		},
		11440:{
			"x":670,
			"y":10,
		},
		11410:{
			"x":10,
			"y":10,
		},
		41461:{
			"x":670,
			"y":10,
		},
	};

var specialCicy = {
		11:1,
		26:1,
		27:1,
		28:1,
		29:1,
		30:1,
		31:1,
		36:1,
};